app/controllers/games_controller.rb

  def index
    @games = Game.order('created_at desc').page(params[:page]).per(2)
---
SELECT  "games".* FROM "games"  ORDER BY created_at desc LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "games"

  def create
    @game = Game.new(game_params)
    @game.first_player_id = current_user.id

    if @game.save!
---
INSERT INTO "games" ("room_name", "first_player_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["room_name", "asfafsa"], ["first_player_id", 1], ["created_at", "2015-11-27 23:37:33.975551"], ["updated_at", "2015-11-27 23:37:33.975551"]]